src/InformationRegisters/ЦеныПродажиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажиНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/РаботаСНоменклатуройСервер/Ext/Module.bsl
Функция НовыйОтборПоКонтрагентуИНоменклатуре(Номенклатура)Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Номенклатура", Номенклатура);
	
	Возврат Результат;
	
КонецФункции

Функция ПоследниеЦеныНоменклатуры(МассивНоменклатуры)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылка)
		|	И НЕ Номенклатура.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныПродажиНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ВТ_Номенклатура.Ссылка КАК Номенклатура,
		|	ВТ_Номенклатура.Ссылка.Наименование КАК Наименование
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПродажиНоменклатуры.СрезПоследних КАК ЦеныПродажиНоменклатурыСрезПоследних
		|		ПО ВТ_Номенклатура.Ссылка = ЦеныПродажиНоменклатурыСрезПоследних.Номенклатура";
	
	Запрос.Параметры.Вставить("Ссылка", МассивНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	

КонецФункции // ()
